InformationRegisters/ДанныеКомплекта.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ДанныеКомплекта</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Конструктор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекущаяСтадия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтадииКомплекта</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Комплект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Композиции</v8:Type>
						<v8:Type>cfg:CatalogRef.ИзделияКомплект</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonForms/ИзменениеКонструктора/Ext/Form/Module.bsl
&НаКлиенте
Процедура Заменить(Команда)

	стВозврата = омВыгрузкаCRMНаКлиенте.ВыгрузитьВPDM(ИзделиеКомплект, "Конструктор", Новый Структура("Отменить", 1));
	
	Если НЕ ПустаяСтрока(стВозврата.ОписаниеОшибки) Тогда
		ПоказатьПредупреждение(,стВозврата.ОписаниеОшибки);	
	КонецЕсли;
	
	Закрыть();

КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	Закрыть();
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИзделияКомплект.Ссылка КАК ИзделиеКомплект,
		|	ДанныеКомплекта.Конструктор КАК Конструктор
		|ИЗ
		|	Справочник.ИзделияКомплект КАК ИзделияКомплект
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеКомплекта КАК ДанныеКомплекта
		|		ПО ДанныеКомплекта.Комплект = ИзделияКомплект.Ссылка
		|ГДЕ
		|	ИзделияКомплект.Код = &Код";
	
	Запрос.УстановитьПараметр("Код", Параметры.КодКомплекта);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ИзделиеКомплект = Выборка.ИзделиеКомплект;
		Конструктор 	= Выборка.Конструктор;
	КонецЦикла;
	
	Если НЕ ЗначениеЗаполнено(ИзделиеКомплект) Тогда
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры
